---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SweepFailures.SweepFailed
source: html/6627ea47-c0ad-c991-a200-ab544226d1d0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SweepFailures.SweepFailed Property

Proper sweep geometry creation failed.

## Syntax (C#)
```csharp
public static FailureDefinitionId SweepFailed { get; }
```